////////////////////////////////////////////////////////////////////////////////////////////
// Задание 1 - Выведите числа от 1 до 50 и от 35 до 8.
document.write('<div class="task"> <h2 class="task-title">Задание 1</h2> <p class="task-description">Выведите числа от 1 до 50 и от 35 до 8.</p> <p>');

for (let i = 1; i <= 50; i++) {
    document.write(i+' ');
}

document.write('</p><p>');

for (let i = 35; i >= 8; i--) {
    document.write(i+' ');
}
document.write('</p></div>');



////////////////////////////////////////////////////////////////////////////////////
//Группа заданий 2-5

document.write('<div class="task-2-5-group">');

/////////////////////////////////////////////////////////////////////////////////////////////
// Задание 2 - Выведите столбец чисел от 89 до 11 - воспользуйтесь циклом while и отделите числа
// тегом <br /> друг от друга, чтобы получить столбец, а не строку.

document.write('<div class="task task2"> <h2 class="task-title">Задание 2</h2> <p class="task-description">Выведите столбец чисел от 89 до 11 - воспользуйтесь циклом while и отделите числа тегом   br друг от друга, чтобы получить столбец, а не строку</p> <p>');

let i = 89;
while (i >= 11) {
    document.write(i+'</br>');
    i--
}

document.write('</p></div>');

/////////////////////////////////////////////////////////////////////////////////////////
// Задание 3 - С помощью цикла найдите сумму чисел от 0 до 100.

document.write('<div class="task"> <h2 class="task-title">Задание 3</h2> <p class="task-description">С помощью цикла найдите сумму чисел от 0 до 100.</p> <p>');

i = 0,
    sum3 = 0;

while (i <= 100) {
    sum3 += i;
    i++;
}

document.write(`Сумма чисел от 0 до 100 равняется ${sum3}.`);

document.write('</p></div>');


///////////////////////////////////////////////////////////////////////////////////////////
// Задание 4 - Найдите сумму чисел в каждом числе от 1 до 5, например: в числе 3 сумма составляет 6
// (1+2+3).

document.write('<div class="task"> <h2 class="task-title">Задание 4</h2> <p class="task-description">Найдите сумму чисел в каждом числе от 1 до 5, например: в числе 3 сумма составляет 6 (1+2+3).</p> <p>');

for (let i = 1; i <= 5; i++) {
    let sum = 0;
    for (let j = 1; j <= i; j++) {
        sum += j;
    }
    document.write(`В числе ${i} сумма составляет ${sum}.<br />`);
}

document.write('</p></div>');


///////////////////////////////////////////////////////////////////////////////////////////
// Задание 5 - Выведите чётные числа от 8 до 56. Решить задание через while и for.

document.write('<div class="task"> <h2 class="task-title">Задание 5</h2> <p class="task-description">Выведите чётные числа от 8 до 56. Решить задание через while и for.</p> <p>');

document.write('Решение через for:');
for (let i = 8; i <= 56; i += 2) {
    document.write(' '+i);
}

document.write('<br />Решение через while:');
i = 8;
while (i<=56) {
    if (i%2 == 0) {
        document.write(' '+i);
    }
    i++;
}

document.write('</p></div>');

///////////////////////////////////////////////////////////////////////////////////
document.write('</div>');
//Конец группы заданий 2-5
///////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////
// Задание 6 - Необходимо вывести на экран полную таблицу умножения (от 2 до 10).

document.write('<div class="task"> <h2 class="task-title">Задание 6</h2> <p class="task-description">Необходимо вывести на экран полную таблицу умножения (от 2 до 10).</p> <div class="task6-decision">');

for (let i = 2; i<=10; i++) {
    document.write("<p>");
    for (let j = 1; j <= 10; j++) {
        document.write(`${i} * ${j} = ${i*j} <br />`);
    }

    document.write("</p>");
}

document.write('</div></div>');



/////////////////////////////////////////////////////////////////////////////////////////
// Задание 7 - Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет
// меньше 50. Какое число получится? Посчитайте количество итераций, необходимых
// для этого (итерация - это проход цикла), и запишите его в переменную num.

document.write('<div class="task"> <h2 class="task-title">Задание 7</h2> <p class="task-description">Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную num.</p> <p>');

let task_7_variable = 1000,
    task_7_num = 0;

while (task_7_variable >= 50) {
    task_7_variable /= 2;
    task_7_num += 1;
}    

document.write(`Для выполнения задания необходимо ${task_7_num} итераций.`);



document.write('</p></div>');


///////////////////////////////////////////////////////////////////////////////////////////
/* Задание 8 - Запустите цикл, в котором пользователю предлагается вводить число с клавиатуры, до
тех пор, пока не будет введена пустая строка или 0. После выхода из цикла выведите
общую сумму и среднее арифметическое введённых чисел. Если пользователь ввел не
число, то вывести сообщение об ошибке ввода. При подсчете учесть, что пользователь
может ввести отрицательное значение. */


document.write('<div class="task"> <h2 class="task-title">Задание 8</h2> <p class="task-description">Запустите цикл, в котором пользователю предлагается вводить число с клавиатуры, до тех пор, пока не будет введена пустая строка или 0. После выхода из цикла выведите общую сумму и среднее арифметическое введённых чисел. Если пользователь ввел не число, то вывести сообщение об ошибке ввода. При подсчете учесть, что пользователь может ввести отрицательное значение.</p> <p>');

let task_8_variable,
    task_8_sum = 0,
    task_8_attempts = 0;

while (1) {
    task_8_variable = prompt('Введите целое число, положительное или отрицательное, если будет введен 0 или пустая строка, запросы прекратятся.');

    if (task_8_variable == '0' || task_8_variable == '') break;

    task_8_variable = parseInt(task_8_variable);

    if (isNaN(task_8_variable)) {
        alert('Ввод некорректен.');
    }
    else {
        task_8_sum += task_8_variable;
        task_8_attempts += 1;
    }
}

document.write(`Сумма введенных вами чисел равна: ${task_8_sum}. Среднее арифметическое: ${task_8_sum/task_8_attempts}.`);

document.write('</p></div>');


//////////////////////////////////////////////////////////////////////////////////////////////////////
// Задание 9 - Дана строка с числами разделенными пробелами «4 98 4 6 1 32 4 65 4 3 5 7 89 7 10 1 36
// 8 57». Найдите самое большое и самое маленькое число в строке, используя цикл.

document.write('<div class="task"> <h2 class="task-title">Задание 9</h2> <p class="task-description">Дана строка с числами разделенными пробелами «4 98 4 6 1 32 4 65 4 3 5 7 89 7 10 1 36 8 57». Найдите самое большое и самое маленькое число в строке, используя цикл.</p> <p>');

let task_9_string = '4 98 4 6 1 32 4 65 4 3 5 7 89 7 10 1 36 8 57',
    task_9_min = Infinity,
    task_9_max = -Infinity,
    task_9_item = '';

for (let i = 0; task_9_string[i] != undefined; i++) {
    if (task_9_string[i] == ' ') {
        task_9_item = Number(task_9_item);
        if (task_9_item > task_9_max) {
            task_9_max = task_9_item;
        }
        if (task_9_item < task_9_min) {
            task_9_min = task_9_item;
        }
        task_9_item = '';
    }
    else {
        task_9_item += task_9_string[i];
    }
}
document.write(`Минимальное число в строке: ${task_9_min} <br />`);
document.write(`Максимальное число в строке: ${task_9_max}`);

document.write('</p></div>');

//////////////////////////////////////////////////////////////////////////////////////////////////////
/* Задание 10 - Дано произвольное целое число n. Написать программу, которая:
a. разбивает число n на цифры и выводит их на экран;
b. подсчитывает сколько цифр в числе n;
c. находит сумму цифр числа n;
d. меняет порядок цифр числа n на обратный.
Пример: вводится число 123: цифр в числе = 3; сумма = 6; обратный порядок 321. */

document.write('<div class="task"> <h2 class="task-title">Задание 10</h2> <p class="task-description">Произвольное целое число разбить на цифры, посчитать сколько цифр, найти сумму цифр числа поменять порядок цифр числа на обратный</p> <p>');

let task_10_varible;

while (isNaN(parseInt(task_10_varible))) {
    task_10_varible = prompt('Введите целое число');
}

task_10_varible = parseInt(task_10_varible);



let task_10_num_of_numerals = 1,
    task_10_sum = 0,
    task_10_reverse ='',
    task_10_numeral,
    ten = 10;

while (task_10_varible/ten >= 1) {      // Считаем количество цифр
    task_10_num_of_numerals += 1;
    ten *= 10;
}
                                        // Почему работает только до 16-значного числа?
ten = 10;

for (let i = 0; i < task_10_num_of_numerals; i++) {
    task_10_numeral = (task_10_varible%ten - task_10_varible%(ten/10)) / (ten/10);
    ten *= 10;
    task_10_reverse += task_10_numeral;
    task_10_sum += task_10_numeral;
}

ten = 10;

for (let i = 0; i < task_10_num_of_numerals; i++) {
    task_10_numeral = (task_10_reverse%ten - task_10_reverse%(ten/10)) / (ten/10);
    ten *= 10;
    document.write(`${i+1}-я цифра: ${task_10_numeral}. <br />`);
}

document.write(`Количество цифр - ${task_10_num_of_numerals}. <br />`);
document.write(`Сумма цифр - ${task_10_sum}. <br />`);
document.write(`Обратная запись - ${task_10_reverse}. <br />`);

document.write('</p></div>');

/////////////////////////////////////////////////////////////////////
